print("Добро пожаловать в мини-квиз!")
score = 0

# Вопрос 1
answer1 = input("Сколько будет 5 + 5 * 2? ")
if answer1 == "15":
    print("Верно!")
    score += 1
else:
    print("Ошибка! Правильный ответ: 15")

# Вопрос 2
answer2 = input("Какая планета третья от Солнца? ")
if answer2.lower() == "земля":
    print("Верно!")
    score += 1
else:
    print("Ошибка! Правильный ответ: Земля")

# Вопрос 3
answer3 = input("Какое расширение у файлов с кодом на Python? (.py или .pt) ")
if answer3.lower() == ".py":
    print("Верно!")
    score += 1
else:
    print("Ошибка! Правильный ответ: .py")

# Итоги
print("\Квиз окончен!")
print("Ваш итоговый счет:", score)

if score == 3:
    print("Ваша оценка: 5 (Отлично!)")
elif score == 2:
    print("Ваша оценка: 4 (Хорошо!)")
else:
    print("Ваша оценка: 3 (Нужно повторить материал)")